Revit 2024 API
Application.FamilyLoadedIntoDocument Event
 Subscribe to the FamilyLoadedInto event to be notified after Revit loaded a family into a document.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public event EventHandler<FamilyLoadedIntoDocumentEventArgs> FamilyLoadedIntoDocument
Visual Basic
Public Event FamilyLoadedIntoDocument As EventHandler(Of FamilyLoadedIntoDocumentEventArgs)
Visual C++
public:
 event EventHandler<FamilyLoadedIntoDocumentEventArgs^>^ FamilyLoadedIntoDocument {
	void add (EventHandler<FamilyLoadedIntoDocumentEventArgs^>^ value);
	void remove (EventHandler<FamilyLoadedIntoDocumentEventArgs^>^ value);
}
Remarks
This event is raised immediately after Revit has finished loading a family into a document. It is raised even when family loading failed or was cancelled (during FamilyLoadingIntoDocument event).
 Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of importing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Close() and similar overloads.
Exception InvalidOperationException will be thrown if any of the above methods is called during this event.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace